app/Http/Controllers/Api/Panel/CartController.php

    public function index()
    {
        $user = apiAuth();
        $carts = Cart::where('creator_id', $user->id)
            ->with([
                'productOrder' => function ($query) {
                    $query->whereHas('product');
                }
            ])
            ->get();
---
select * from `cart` where `creator_id` = 1047
select * from `product_orders` where 0 = 1 and exists (select * from `products` where `product_orders`.`product_id` = `products`.`id`)

   public function directCheckout(Request $request)
    {
        if (! $request->hasValidSignature()) {
            abort(403, 'Invalid or expired link.');
        }

        $userId = $request->input('user_id');
        $discountId = $request->input('discount_id');

        $user = \App\User::find($userId);
---
select * from `users` where `users`.`id` = 1048 limit 1