app/Http/Controllers/Api/Panel/ReserveMeetingsController.php

    public function getReservation()
    {

        $user = apiAuth();
        $reservedMeetings = ReserveMeeting::where('user_id', $user->id)
            ->whereHas('sale')
            ->whereNotNull('reserved_at')
            ->orderBy('created_at', 'desc')
            ->get()
            ->map(function ($reserveMeeting) {
                return $reserveMeeting->details;
            });
---
select * from `reserve_meetings` where `user_id` = 1047 order by `created_at` desc

    public function getReservation()
    {
        $user = apiAuth();

        if (!$user) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }

        $query = ReserveMeeting::query()
            ->whereHas('sale') // ensure a related sale exists
            ->whereNotNull('reserved_at') // ensure it's reserved
            ->orderBy('created_at', 'desc');

        if ($user->isTeacher()) {
            $meetingIds = Meeting::where('creator_id', $user->id)->pluck('id');
---
select `id` from `meetings` where `creator_id` = 1047