app/Http/Controllers/Api/Panel/UsersController.php

update `user_firebase_sessions` set `fcm_token` = 'cJQ05rdRRVmkE15uTPu-tB:APA91bGCEHBf_At_5PolrZHfFdaxawGDAARVDLdh8zV0sWvxfxovZAoVE2BPA3sDMrzBjvxzC0QNJBi4hdXdM7NDqkgDVs8B-6Ey5zoV4k3Is6tNNisTqoo', `user_firebase_sessions`.`updated_at` = '2025-05-14 10:32:07' where `id` = 14
---
    public function fcm()
    {
        $session = UserFirebaseSessions::where("token", request()->bearerToken())->get()->first();
        abort_unless($session, 404);
        $session->fcm_token = \request("token");
        $session->save();