app/Http/Controllers/Api/Config/ConfigController.php

select * from `payment_channels`
---
    public static function get()
    {
        $registerMethod = getGeneralSettings('register_method') ?? 'mobile';

        $userLanguages = getGeneralSettings('user_languages');
        if (!empty($userLanguages) and is_array($userLanguages)) {
            $userLanguages = getLanguages($userLanguages);
        } else {
            $userLanguages = [];
        }
        $paymentChannels = PaymentChannel::all()->groupBy('status');