app/User.php

select * from `groups` where `groups`.`id` = 5 limit 1
---
    public function getUserGroup()
    {
        if (empty($this->user_group)) {
            if (!empty($this->userGroup) and !empty($this->userGroup->group) and $this->userGroup->group->status == 'active') {

select * from `meetings` where `disabled` = 0 and `creator_id` = 1048 limit 1
---
    public function hasMeeting()
    {
        $meeting = Meeting::where('disabled', false)
            ->where('creator_id', $this->id)
            ->first();