app/Mixins/Logs/UserLoginHistoryMixin.php

insert into `user_login_histories` (`user_id`, `browser`, `device`, `os`, `ip`, `country`, `city`, `location`, `session_id`, `session_start_at`, `session_end_at`, `created_at`) values (1047, 0, 'desktop', '-', '', '', '', '', 'RZBe5Lb6G4GScmD5MLaDL7umUEDzCkCMUrF5ERAI', 1747218710, '', 1747218710)
---
    public function storeUserLoginHistory($user)
    {
        $ipAddress = $_SERVER['REMOTE_ADDR']; // "46.143.59.39"
        $country = null;
        $city = null;
        $location = null;

        $locationData = $this->getUserLocation($ipAddress);
        if (!empty($locationData) and !empty($locationData['status']) and $locationData['status'] == "success") {
            $country = $locationData['country'] ?? null;
            $city = $locationData['city'] ?? null;
            $location = (!empty($locationData['lat']) and !empty($locationData['lon'])) ? "{$locationData['lat']},{$locationData['lon']}" : null;
        } else {
            $ipAddress = null;
        }

        $userSession = session()->getId();

        UserLoginHistory::query()->create([
            'user_id' => $user->id,
            'browser' => $this->browser,
            'device' => $this->deviceType,
            'os' => $this->os,
            'ip' => $ipAddress,
            'country' => $country,
            'city' => $city,
            'location' => !empty($location) ? DB::raw("point({$location})") : null,
            'session_id' => $userSession,
            'session_start_at' => time(),
            'session_end_at' => null,
            'created_at' => time(),
        ]);